{"backend": "tensorflow", "config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_3", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_3", "batch_input_shape": [null, 150, 150, 3]}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block1_conv1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 64, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block1_conv2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 64, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "block1_pool", "trainable": false}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block2_conv1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 128, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block2_conv2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 128, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "block2_pool", "trainable": false}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block3_conv1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 256, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block3_conv2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 256, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block3_conv3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 256, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "block3_pool", "trainable": false}, "class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block4_conv1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block4_conv2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block4_conv3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "block4_pool", "trainable": false}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block5_conv1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block5_conv2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "block5_conv3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "activation": "relu", "filters": 512, "use_bias": true, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "block5_pool", "trainable": false}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten", "name": "flatten_3", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 3, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}], "name": "model_3"}, "class_name": "Model", "keras_version": "2.1.4"}